app/Models/ModelAuth.php

    public function login($username,$password)
    {
        return $this->db->table('user')->where([
            'username'=>$username,
            'password'=>$password,
        ])->get()->getRowArray();
---
SELECT *
FROM `user`
WHERE `username` = 'irfan'
AND `password` = '123123'